{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "import re\n",
    "import uuid\n",
    "\n",
    "import pandas as pd\n",
    "import seaborn as sns\n",
    "import numpy as np\n",
    "import matplotlib.pyplot as plt\n",
    "%matplotlib inline\n",
    "\n",
    "from utilities import log_progress\n",
    "\n",
    "from py2neo import Graph\n",
    "\n",
    "graph = Graph('https://hobby-ijiahihliahcgbkepnpggmbl.dbs.graphenedb.com:24780/db/data/',\n",
    "              user='remote',\n",
    "              password=\"b.WKJhDFo38DGT.XBFHkuTL7R6BEEgw\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [],
   "source": [
    "def set_note(doctrine, note):\n",
    "    note = re.sub('\\\\x08', '\\\\\\\\b', note)\n",
    "    note = re.sub('\\\\t', '\\\\\\\\t', note)\n",
    "    note = re.sub('\\\\r', '\\\\\\\\r', note)\n",
    "    note = re.sub(r'\\\\([a-z])', r'\\\\\\\\\\1', note)\n",
    "    q = (\"MATCH (d:Doctrine {description:'%s'}) \"\n",
    "         \"SET d.note = '%s' return d.note as note\" % (doctrine, note))\n",
    "    return graph.run(q).data()[0]['note']"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Utility and setting doctrines"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {
    "scrolled": false
   },
   "outputs": [],
   "source": [
    "q = (\"MATCH (d:Doctrine)--(i:Instance)--(:DissertationPart {chapter:4}) \"\n",
    "     \"RETURN distinct d.description, count(distinct i) as number \"\n",
    "     \"ORDER BY number DESC\")\n",
    "\n",
    "table = graph.run(q).to_table()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "There are no doctrines without a note property.\n"
     ]
    }
   ],
   "source": [
    "q = (\"MATCH (d:Doctrine)--(i:Instance)--(:DissertationPart {chapter:4}) \"\n",
    "     \"WHERE NOT exists(d.note) \"\n",
    "     \"RETURN distinct d.description, d.label, count(distinct i) as number \"\n",
    "     \"ORDER BY number DESC\")\n",
    "cursor = graph.run(q)\n",
    "#table = cursor.to_table()\n",
    "try:\n",
    "    res = cursor.data()[0]\n",
    "    print(res['d.description'])\n",
    "except IndexError:\n",
    "    print('There are no doctrines without a note property.')\n",
    "#table"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "  \\label{item:inv:doctrine:prime-matter}\n",
      "  The possible intellect stands to the intelligible species as prime matter\n",
      "  stands to forms. The is based on the idea of the complete potentiality of the\n",
      "  intellect before the act of knowing.\n",
      "\n"
     ]
    }
   ],
   "source": [
    "note = \"\"\"\n",
    "  \\label{item:inv:doctrine:prime-matter}\n",
    "  The possible intellect stands to the intelligible species as prime matter\n",
    "  stands to forms. The is based on the idea of the complete potentiality of the\n",
    "  intellect before the act of knowing.\n",
    "\"\"\"\n",
    "note = re.sub('\\\\x08', '\\\\\\\\b', note)\n",
    "note = re.sub('\\\\t', '\\\\\\\\t', note)\n",
    "note = re.sub('\\\\r', '\\\\\\\\r', note)\n",
    "note = re.sub('\\\\f', '\\\\\\\\f', note)\n",
    "note = re.sub(\"\\'\", \"\\\\'\", note)\n",
    "#note = re.sub(r'\\\\([a-z])', r'\\\\\\\\\\1', note)\n",
    "\n",
    "print(set_note('Possible intellect similar to prime matter', note))\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [],
   "source": [
    "def rename_doctrine(old, new):\n",
    "    q = (\"MATCH (d:Doctrine {description:'%s'}) \"\n",
    "         \"SET d.description = '%s' \"\n",
    "         \"RETURN d.description \"% (old, new) )\n",
    "    return graph.run(q).evaluate()\n",
    "\n",
    "rename_doctrine(\n",
    "    old='The agent intellect has no knowledge', \n",
    "    new='Power of the agent intellect not intelligible'\n",
    ")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Predict the labels for the appendices and set the m in the DB"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "82e40709d2344121850e03e2eeacea59",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "VBox(children=(HTML(value=''), IntProgress(value=0, max=612)))"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "# First, reset all uuids if necessary\n",
    "ids = graph.run(\"MATCH (n) return id(n)\").data()\n",
    "for i in log_progress(ids):\n",
    "    graph.run(\"MATCH (n) where id(n) = %i SET n.uuid = '%s' return n\" % (i['id(n)'], uuid.uuid4())).data()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {
    "scrolled": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Primary and secondary intelligibility: ['P1']\n",
      "Substantial knowledge from accidents: ['P2']\n",
      "Self-knowledge through external species: ['P3']\n",
      "Possible intellect completely indeterminate before actualization by an external species: ['P4']\n",
      "An immaterial substance is self-reflexive: ['P5']\n",
      "Science about subject, parts or properties, principles: ['P6']\n",
      "The intellect is self-intelligible: ['P7']\n",
      "Intellect intelligble through external species: ['P8']\n",
      "Agent intellect known through its products: ['P9']\n",
      "Possible intellect similar to prime matter: ['P10']\n",
      "Science through self-reflection: ['P11']\n",
      "Great chain of being and the intellect: ['P12']\n",
      "The intellect is intelligible: ['P13']\n",
      "Successive self-knowledge: ['P14']\n",
      "Proper and improper science: ['P15']\n",
      "Form of particular can be studied as a universal: ['P16']\n",
      "The soul is difficult but not impossible to know: ['P17']\n",
      "Self-knowledge different from the science of the soul: ['P18']\n",
      "Intellect especially difficult to know: ['P19']\n",
      "Bodily senses are not reflexive: ['P20']\n",
      "Three meanings of science: ['P21']\n",
      "Identity of knower and known in immaterial substances: ['P22']\n",
      "The intellect has essential self-knowledge: ['P23']\n",
      "Knowing a blocking activity: ['P24']\n",
      "No identity of knower and known before actualization of possible intellect: ['P25']\n",
      "Analogy with vision: Only things visible in act can be perceived: ['P26']\n",
      "Soul has parts and properties in virtue of its embodied activities: ['P27']\n",
      "Perfect mover can move itself: ['P28']\n",
      "Perpetual self-knowledge of agent intellect not available to humans: ['P29']\n",
      "Self-knowledge by own species, once actualized by external species: ['P30']\n",
      "Intelligibility requires actuality: ['P31']\n",
      "Infinite regress not a problem in the intellect: ['P32']\n",
      "The intellect can observe its own activity: ['P33']\n",
      "Knowledge may proceed from temporal to atemporal matters: ['P34']\n",
      "Knowing a power does not mean knowing its products: ['P35']\n",
      "Not all universals are abstracted from sense perception: ['P36']\n",
      "Science about a substance which contains parts and properties: ['P37']\n",
      "The soul is not known through phantasms: ['P38']\n",
      "Subsistence is not a requirement as long at it is the subject of properties: ['P39']\n",
      "Possible and agent intellect joined in constant knowledge: ['P40']\n",
      "Only restriction of identity in physical movement: ['P41']\n",
      "Objects of knowledge need not be temporal, but analysis is: ['P42']\n",
      "Intellect not its own proper object of knowledge: ['P43']\n",
      "The stronger principle of attribution: ['P44']\n",
      "No science of the separate soul: ['P45']\n",
      "Essential self-knowledge in the afterlife: ['P46']\n",
      "Intellect is perceptible after actualization: ['P47']\n",
      "Internal experience of own mental faculties: ['P48']\n",
      "Multiple simultaneous objects of knowledge is possible: ['P49']\n",
      "Science from observations of accidents is also science: ['P50']\n",
      "Soul does exists as something outside itself (in certain sense): ['P51']\n",
      "Three types of knowledge from one species: ['P52']\n",
      "Superiority to sense-perception: ['P53']\n",
      "Concomitant higher-order knowledge: ['P54']\n",
      "Soul intelligible as object of dubium: ['P55']\n",
      "Material objects can never become intellects: ['P56']\n",
      "Certain science about simple subject: ['P57']\n",
      "Atemporal soul the actualization of temporal body: ['P58']\n",
      "Only material things cannot receive their own species: ['P59']\n",
      "Self-knowledge by innate species: ['P60']\n",
      "Science by answering (four) scientific questions: ['P61']\n",
      "Diversification only a problem with same mode of being: ['P62']\n",
      "Soul is simple in essence but has different powers (partes potentiales): ['P63']\n",
      "Act and potency with different respects: ['P64']\n",
      "The agent intellect is known like any other object: ['P65']\n",
      "Intellect is incorruptible: ['P66']\n",
      "Essential self-knowledge results in no self-knowledge: ['P67']\n",
      "Transference of properties from agent to patient (e.g. light and the visible object): ['P68']\n",
      "Soul not available to sense perception: ['P69']\n",
      "Only physical movement requires difference between mover and moved: ['P70']\n",
      "Vague, incomplete self-knowledge possible: ['P71']\n",
      "Self-knowledge necessary for a science of the soul: ['P72']\n",
      "Soul not intelligible to us: ['P73']\n",
      "The intellect is intelligible like any other thing: ['P74']\n",
      "Agent intellect the most venerable object of knowledge: ['P75']\n",
      "Science requires intelligible essence or definition: ['P76']\n",
      "Intellect not available to sense perception: ['P77']\n",
      "The intellect can know completely immaterial things: ['P78']\n",
      "Four requirements of a science: ['P79']\n",
      "Science of form and perfection: ['P80']\n",
      "Soul not intelligible to us: ['P73', 'N1']\n",
      "Soul not available to sense perception: ['P69', 'N2']\n",
      "Identity of mover and moved impossible: ['N3']\n",
      "Intellect not available to sense perception: ['P77', 'N4']\n",
      "Identity of knower and known impossible: ['N5']\n",
      "Knowledge is continuous and temporal, but soul is simple: ['N6']\n",
      "Science about subject, parts or properties, principles: ['P6', 'N7']\n",
      "Similar to separate intelligences: ['N8']\n",
      "Things most manifest in nature are opaque, so no science of the soul: ['N9']\n",
      "Knowing the act of the intellect risks infinite regress: ['N10']\n",
      "Soul is a particular, so there can be no science about it: ['N11']\n",
      "Analogy with sense and sensation: ['N12']\n",
      "No abstraction of the intellect: ['N13']\n",
      "No science about corruptible things: ['N14']\n",
      "Nothing can be stripped of itself: ['N15']\n",
      "Intellect not its own proper object of knowledge: ['P43', 'N16']\n",
      "Self-knowledge by innate species: ['P60', 'N17']\n",
      "All intelligibles become intellects if intellect is intelligible: ['N18']\n",
      "No universal about the soul, as it requires sense perception: ['N19']\n",
      "No simultaneous act and potency: ['N20']\n",
      "The possible intellect is not actualized: ['N21']\n",
      "Material intelligibles cannot know themselves: ['N22']\n",
      "No species proportional to the intellect: ['N23']\n",
      "No experience of higher-order knowledge: ['N24']\n",
      "Essential self-intelligibility by self-identity: ['N25']\n",
      "Agent intellect has no positive content: ['N26']\n",
      "Accidents cannot affect their own subject: ['N27']\n",
      "Nothing can move itself (knowledge is being-moved): ['N28']\n",
      "Diversification of knowledge according to object: ['N29']\n",
      "No essential self-knowledge, so not self-knowledge by own species: ['N30']\n",
      "Science proceeds from causes, so no science about the soul: ['N31']\n",
      "Essential self-knowledge by self-presence: ['N32']\n",
      "Intelligibility requires actuality: ['P31', 'N33']\n",
      "Intellectual self-knowledge is impossible: ['N34']\n",
      "Nothing simpler than the intellect, hence no species abstraction: ['N35']\n",
      "No science about the non-existent: ['N36']\n",
      "Knowing agent intellect means knowing all phantasms: ['N37']\n",
      "Nothing can receive its own species: ['N38']\n",
      "Power of the agent intellect not intelligible: ['N39']\n",
      "The intellect has essential self-knowledge: ['P23', 'N40']\n",
      "Multiple simultaneous objects of knowledge impossible: ['N41']\n"
     ]
    }
   ],
   "source": [
    "positive_q = (\"\"\"\n",
    "    MATCH (i:Instance)-[:OF|SUPPORTS|IMPLIES]-(d:Doctrine)\n",
    "    WHERE (not exists(i.type) or i.type = 'Conclusion' or i.type = 'Refutation') \n",
    "    AND NOT d.description = 'There can be a science of the soul'\n",
    "    RETURN distinct d.description as title, d.uuid as uuid, d.note as note, count(distinct i) as usage\n",
    "\"\"\")\n",
    "negative_q = (\"\"\"\n",
    "    MATCH (i:Instance)-[:OF|SUPPORTS|IMPLIES]-(d:Doctrine) \n",
    "    WHERE i.type = 'Negative ratio'\n",
    "    AND NOT d.description = 'There can be a science of the soul'\n",
    "    RETURN distinct d.description as title, d.uuid as uuid, d.note as note, count(distinct i) as usage\n",
    "\"\"\")\n",
    "\n",
    "# Remove all existing labels before we add them again\n",
    "graph.run(\n",
    "    \"MATCH (d:Doctrine) \"\n",
    "    \"SET d.label = []\"\n",
    ")\n",
    "\n",
    "def add_labels(query, prefix=''):\n",
    "    query_sorted = sorted(graph.run(query).data(), key=lambda k: k['usage'], reverse=True) \n",
    "    for i, d in enumerate(query_sorted, 1):\n",
    "        label = prefix + str(i)\n",
    "        out = graph.run(\n",
    "            \"MATCH (d) where d.uuid = '%s' \"\n",
    "            \"SET d.label = d.label + ['%s'] \" \n",
    "            \"RETURN d.label\" % (d['uuid'], label)).evaluate()\n",
    "        print(d['title'] + ': ' + str(out))\n",
    "    return query_sorted\n",
    "\n",
    "positive_sorted = add_labels(positive_q, prefix='P')\n",
    "negative_sorted = add_labels(negative_q, prefix='N')"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Produce the appendices"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {
    "scrolled": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\\begin{inventory}[label=P\\arabic*, font=\\bfseries]\n",
      "\n",
      "\\invitem{Primary and secondary intelligibility}\n",
      "  Something that is not intelligible in itself can however be intelligible\n",
      "  through its actualization by something else. Generalization of\n",
      "  \\ref{item:inv:doctrine:transference-of-intelligibility}.\n",
      "  \\label{item:inv:primary-secondary-intelligibility}\n",
      "\n",
      "\\invitem{Substantial knowledge from accidents}\n",
      "  Stronger version of the\n",
      "  self-observation thesis. Through a stepwise process the intellect acquires\n",
      "  knowledge about its own substance by\n",
      "  \\begin{inparaenum}\n",
      "  \\item first observing its own handling of its primary object of knowledge,\n",
      "  \\item informing it about the kind of activity it engages in,\n",
      "  \\item this reveals which powers the intellect possesses\n",
      "  \\item which finally yields insights into the substance that possesses these powers.\n",
      "  \\end{inparaenum}\n",
      "  \\label{item:inv:knowledge-from-accidents}\n",
      "\n",
      "\\invitem{Self-knowledge through external species}\n",
      "  \\begin{enumerate}\n",
      "  \\item The possible intellect is completely indeterminate before actualization\n",
      "    through an external species.\n",
      "  \\item The possible intellect must be actualized to be able to engage in\n",
      "    self-knowledge.\n",
      "  \\item $\\therefore$ The possible intellect engages in self-knowledge through\n",
      "    actualization by an external species.\n",
      "  \\end{enumerate}\n",
      "  This is a stronger version of\n",
      "  \\ref{item:inv:doctrine:self-intelligible-by-species}. The process of how the\n",
      "  self-knowledge comes about naturally has to be expanded by the commentator.\n",
      "  \\label{item:inv:positive:doctrine:SK-by-external-species}\n",
      "\n",
      "\\invitem{Possible intellect completely indeterminate before actualization by an external species}\n",
      "  \\begin{enumerate}\n",
      "  \\item What is known must be in act.\n",
      "  \\item The possible intellect is not in act until is knows something else.\n",
      "  \\item $\\therefore$ Therefore the possible intellect cannot be known until\n",
      "    it knows something else.\n",
      "  \\end{enumerate}\n",
      "  \\label{item:inv:positive:doctrine:possible-intellect-potential}\n",
      "\n",
      "\\invitem{An immaterial substance is self-reflexive}\n",
      "  \\begin{enumerate}\n",
      "  \\item An immaterial substance is self-reflexive.\n",
      "  \\item The human intellect is an immaterial substance.\n",
      "  \\item $\\therefore$ The human intellect is self-reflexive.\n",
      "  \\end{enumerate}\n",
      "  This doctrine may be phrased as a complete return to itself (\\emph{reditio\n",
      "    completa}) with reference to \\oldcitetitle{liber-de-causis}. For the human\n",
      "  intellect this often includes restriction on external actualization.\n",
      "  \\label{item:inv:doctrine:self-reflexivity}\n",
      "\n",
      "\\invitem{Science about subject, parts or properties, principles}\n",
      "  \\label{science:inv:doctrine:subject-properties-principles:positive}\n",
      "  \\label{science:inv:doctrine:subject-properties-principles:negative}\n",
      "  A science requires\n",
      "  \\begin{inparaenum}\n",
      "  \\item a subject,\n",
      "  \\item properties that are ascribed to the subject, and\n",
      "  \\item the principle according to which the properties are ascribed to it.\n",
      "  \\end{inparaenum}\n",
      "  Positive use: The investigation of the soul fulfills all these three requirements. The\n",
      "  definition of the soul can be used as the principle by which the properties\n",
      "  are ascribed to the subject.\n",
      "\n",
      "  Negative use: The soul as form is not a subject, because it is not a hylomorphic compound.\n",
      "\n",
      "\\invitem{The intellect is self-intelligible}\n",
      "  \\label{item:inv:doctrine:self-intelligible-by-species}\n",
      "  \\begin{enumerate}\n",
      "  \\item The intellect is potentially any intelligible object.\n",
      "  \\item When the intellect is actualized by the species of an intelligible\n",
      "    object, it can know itself.\n",
      "  \\item $\\therefore$ The intellect is potentially potentially self-intelligible.\n",
      "  \\end{enumerate}\n",
      "  This is a stronger version of\n",
      "  \\ref{item:inv:doctrine:transference-of-intelligibility}.\n",
      "\n",
      "\\invitem{Intellect intelligble through external species}\n",
      "  \\begin{enumerate}\n",
      "  \\item The intellect cannot be known before it is actualized.\n",
      "  \\item The intellect is actualized by an external species.\n",
      "  \\item $\\therefore$ The intellect is known through an external species.\n",
      "  \\end{enumerate}\n",
      "  This is not always a sufficient condition for intellectual\n",
      "  self-knowledge.\\label{item:inv:doctrine:transference-of-intelligibility}\n",
      "\n",
      "\\invitem{Agent intellect known through its products}\n",
      "  The agent intellect is known by observation of its activity and results,\n",
      "  namely abstraction of universals.\n",
      "  \\label{item:inv:doctrine:agent-intellect-known-through-products}\n",
      "\n",
      "\\invitem{Possible intellect similar to prime matter}\n",
      "  \\label{item:inv:doctrine:self-intelligible-by-species}\n",
      "  \\begin{enumerate}\n",
      "  \\item The intellect is potentially any intelligible object.\n",
      "  \\item When the intellect is actualized by the species of an intelligible\n",
      "    object, it can know itself.\n",
      "\n",
      "\\invitem{Science through self-reflection}\n",
      "  An incorporeal thing can reflect\n",
      "  on itself, and by virtue of that we can have a science of the soul. This is a\n",
      "  necessary, but not always sufficient, condition for the science.\n",
      "  \\label{science:inv:doctrine:self-reflection}\n",
      "\n",
      "\\invitem{Great chain of being and the intellect}\n",
      "  In a hierarchy of being the first mover knows itself\n",
      "  (and possibly all subordinate beings) essentially. The separate intelligences\n",
      "  know only themselves essentially. The human intellect can only know itself\n",
      "  through the actualization by an external species.\n",
      "  \\label{item:inv:doctrine:chain-of-being}\n",
      "\n",
      "\\invitem{The intellect is intelligible}\n",
      "  \\begin{enumerate}\n",
      "  \\item Any actualized thing can be an object of knowledge.\n",
      "  \\item The intellect is actualized by an external species.\n",
      "  \\item $\\therefore$ The intellect can be an object of knowledge through\n",
      "    actualization by an external species.\n",
      "  \\end{enumerate}\n",
      "  \\label{item:inv:doctrine:intelligible-intelligible-once-actualized}\n",
      "\n",
      "\\invitem{Successive self-knowledge}\n",
      "  \\label{item:inv:doctrine:successive}\n",
      "  The self-knowledge does not take place at the same time as the knowledge of\n",
      "  the primary object of knowledge, but subsequent to it. This doctrine can\n",
      "  naturally be combined with the procedure of acquisition of substantial\n",
      "  knowledge from accidents (\\ref{item:inv:knowledge-from-accidents})\n",
      "\n",
      "\\invitem{Proper and improper science}\n",
      "  Knowledge acquired through observation\n",
      "  of effects is not a proper science because it does not proceed from\n",
      "  explanation of causes, and is therefore not \\emph{propter quid} knowledge.\n",
      "  \\label{science:inv:doctrine:proper-improper-science}\n",
      "\n",
      "\\invitem{Form of particular can be studied as a universal}\n",
      "  There can be no science about particulars, but a particular can be viewed as\n",
      "  an example of a universal a thus serve as the object of scientific\n",
      "  investigation.\n",
      "  \\label{science:inv:doctrine:particular-as-universal}\n",
      "\n",
      "\\invitem{The soul is difficult but not impossible to know}\n",
      "  The intellect is among the most obscure things in nature, \n",
      "  but they can be known too, it is just more difficult.\n",
      "  \\label{science:inv:doctrine:intellect-difficult-not-impossible}\n",
      "\n",
      "\\invitem{Self-knowledge different from the science of the soul}\n",
      "  \\label{item:inv:doctrine:different-from-science}\n",
      "  Intellectual self-knowledge does not require the same rigorous investigation\n",
      "  as the science of the soul.\n",
      "\n",
      "\\invitem{Intellect especially difficult to know}\n",
      "  Knowing the intellect is\n",
      "  particularly difficult, as it not intelligible through observation.\n",
      "  \\label{science:inv:doctrine:intellect-most-difficult}\n",
      "\n",
      "\\invitem{Bodily senses are not reflexive}\n",
      "  \\begin{enumerate}\n",
      "  \\item Only immaterial substances are self-reflexive.\n",
      "  \\item The bodily senses are not immaterial substances.\n",
      "  \\item $\\therefore$ The bodily senses are not self-reflexive.\n",
      "  \\end{enumerate}\n",
      "  \\label{item:inv:doctrine:bodily-senses-not-reflexive}\n",
      "\n",
      "\\invitem{Three meanings of science}\n",
      "  `Science' can be of something in three different ways. It can be of something\n",
      "  \\begin{inparaenum}\n",
      "  \\item as about a subject,\n",
      "  \\item as about a conclusion in a demonstration, or\n",
      "  \\item as about a property of a subject.\n",
      "  \\end{inparaenum}\n",
      "  \\label{science:inv:doctrine:three-meanings-of-science}\n",
      "\n",
      "\\invitem{Identity of knower and known in immaterial substances}\n",
      "  \\begin{enumerate}\n",
      "  \\item Complete certainty when the knower and known are identical.\n",
      "  \\item In the soul the knower is identical with the known.\n",
      "  \\item $\\therefore$ There must be a science of the soul.\n",
      "  \\end{enumerate}\n",
      "  \\label{science:inv:doctrine:identity-of-knower-known}\n",
      "\n",
      "\\invitem{The intellect has essential self-knowledge}\n",
      "  \\label{item:inv:doctrine:essential-self-knowledge:positive}\n",
      "  \\label{item:inv:doctrine:essential-self-knowledge:negative}\n",
      "  The intellect has essential self-knowledge and is hence not known through an\n",
      "  external species.\n",
      "\n",
      "\\invitem{Knowing a blocking activity}\n",
      "  \\label{item:inv:doctrine:blocking-activity}\n",
      "  The intellect cannot know more than one thing at any time because knowing is a\n",
      "  blocking activity. Essential, and thus constant, self-knowledge would\n",
      "  therefore result in the impossibility of any other act of knowing.\n",
      "\n",
      "\\invitem{No identity of knower and known before actualization of possible intellect}\n",
      "  This\n",
      "  is an expansion of \\ref{item:inv:doctrine:intelligibility-requires-actuality},\n",
      "  as it makes it clear that self-knowledge is self-identity.\n",
      "  \\label{item:inv:doctrine:no-self-identity-before-actualization}\n",
      "\n",
      "\\invitem{Analogy with vision: Only things visible in act can be perceived}\n",
      "  Just as only actualized objects of vision are visible, so is only the\n",
      "  intellect once actualized.\n",
      "  \\label{item:inv:doctrine:analogy-with-vision}\n",
      "\n",
      "\\invitem{Soul has parts and properties in virtue of its embodied activities}\n",
      "  \\label{item:inv:parts-properties-embodied-activities}\n",
      "\n",
      "\\invitem{Perfect mover can move itself}\n",
      "  A perfect mover is immaterial.\n",
      "  \\label{item:inv:perfect-mover-self-mover}\n",
      "\n",
      "\\invitem{Perpetual self-knowledge of agent intellect not available to humans}\n",
      "  \\label{item:inv:doctrine:agent-intellect-SK-not-available-to-humans}\n",
      "  Although the agent intellect is in a constant state of self-knowledge, and\n",
      "  that knowledge may be available also to the possible intellect, this never\n",
      "  propagates to the level of human knowledge.\n",
      "\n",
      "\\invitem{Self-knowledge by own species, once actualized by external species}\n",
      "  Unlike \\ref{item:inv:positive:doctrine:possible-intellect-potential} the\n",
      "  intellect does have some sort of species before any external stimulus, and\n",
      "  that species is abstracted and known during self-knowledge.\n",
      "  \\label{item:inv:doctrine:SK-by-own-species}\n",
      "\n",
      "\\invitem{Intelligibility requires actuality}\n",
      "  \\label{item:inv:doctrine:intelligibility-requires-actuality:positive}\n",
      "  \\label{item:inv:doctrine:intelligibility-requires-actuality:negative}\n",
      "  No potential property or substance can be actually intelligible. This finds\n",
      "  support in \\oldcite[9.10, 1051b30--32]{arist.Metaph}.\n",
      "\n",
      "\\invitem{Infinite regress not a problem in the intellect}\n",
      "  This\n",
      "  solves the potential problem that self-reflection may result in a regress\n",
      "  problem.\n",
      "  \\label{item:inv:doctrine:infinite-regres-not-problem}\n",
      "\n",
      "\\invitem{The intellect can observe its own activity}\n",
      "  \\label{item:inv:intellect-observe-own-activity}\n",
      "\n",
      "\\invitem{Knowledge may proceed from temporal to atemporal matters}\n",
      "  Knowledge starts from temporal objects but results in atemporal universals.\n",
      "  \\label{science:inv:temporal-to-atemporal}\n",
      "\n",
      "\\invitem{Knowing a power does not mean knowing its products}\n",
      "  It is not possible to determine the products of a power \\emph{a priori}.\n",
      "  \\label{item:inv:knowing-power-not-products}\n",
      "\n",
      "\\invitem{Not all universals are abstracted from sense perception}\n",
      "  \\label{item:inv:not-all-universals-abstracted}\n",
      "\n",
      "\\invitem{Science about a substance which contains parts and properties}\n",
      "  This is closely related to \\ref{science:inv:doctrine:subject-properties-principles}\n",
      "  \\label{science:inv:science-parts-properties}\n",
      "\n",
      "\\invitem{The soul is not known through phantasms}\n",
      "  Only things that have quantity are known through species and phantasms.\n",
      "  \\label{item:inv:soul-no-quantity-no-species}\n",
      "\n",
      "\\invitem{Subsistence is not a requirement as long at it is the subject of properties}\n",
      "  \\ref{science:inv:doctrine:subject-properties-principles} might \n",
      "  presuppose a subsisting subject, which would exclude the soul \n",
      "  as simple, non-hylomorphic form, but a subject with properties \n",
      "  is sufficient.\n",
      "  \\label{item:inv:subsistence-not-requirement}\n",
      "\n",
      "\\invitem{Possible and agent intellect joined in constant knowledge}\n",
      "  \\label{item:inv:doctrine:agent-possible-constant-bond}\n",
      "  The agent intellect is in a constant state of self-knowledge; the possible\n",
      "  intellect is permanently bound to the agent intellect; therefore the possible\n",
      "  intellect is in a constant state of knowing the agent intellect.\n",
      "\n",
      "\\invitem{Only restriction of identity in physical movement}\n",
      "  This solves the challenge that the same thing cannot be mover and moved.\n",
      "  \\label{item:inv:doctrine:restriction-mover-moved}\n",
      "\n",
      "\\invitem{Objects of knowledge need not be temporal, but analysis is}\n",
      "  \\label{item:inv:temporal-analysis-atemporal-object}\n",
      "  The process of knowing an object may not be confused with the nature of the object.\n",
      "  Analysis of atemporal objects can therefore still be temporal.\n",
      "\n",
      "\\invitem{Intellect not its own proper object of knowledge}\n",
      "  \\label{challenges:epist:proper-object:positive}\n",
      "  \\label{challenges:epist:proper-object:negative}\n",
      "  \\begin{enumerate}\n",
      "  \\item The intellect knows its objects of knowledge.\n",
      "  \\item The intellect is not its own object of knowledge.\n",
      "  \\item $\\therefore$ The intellect is not intelligible to itself.\n",
      "  \\end{enumerate}\n",
      "\n",
      "\\invitem{The stronger principle of attribution}\n",
      "  That which is the reason of a property possesses that same property to at\n",
      "  least the same degree, and because the soul facilitates science about\n",
      "  everything other than itself, a science of it must also be possible.\n",
      "  \\label{science:inv:doctrine:stronger-principle-of-attribution}\n",
      "\n",
      "\\invitem{No science of the separate soul}\n",
      "  As the soul is studied as\n",
      "  the actualization of a body, the study of the soul as a separate substance\n",
      "  falls outside the purview of this science.\n",
      "  \\label{science:inv:doctrine:no-science-separate-soul}\n",
      "\n",
      "\\invitem{Essential self-knowledge in the afterlife}\n",
      "  Once the intellect is no\n",
      "  longer encumbered by the materiality of the body, it may engage in essential\n",
      "  self-knowledge.\\label{item:inv:doctrine:essential-SK-afterlife}\n",
      "\n",
      "\\invitem{Intellect is perceptible after actualization}\n",
      "  Once the intellect becomes actualized by a species of a material object it\n",
      "  becomes available to sense perception itself.\n",
      "  \\label{item:inv:doctrine:intellect-material-after-actualization}\n",
      "\n",
      "\\invitem{Internal experience of own mental faculties}\n",
      "  \\label{item:inv:doctrine:internal-experience-parts-of-intellect}\n",
      "  An individual has an internal experience of his own possible intellect and its\n",
      "  difference from the agent intellect and the intelligible species.\n",
      "\n",
      "\\invitem{Multiple simultaneous objects of knowledge is possible}\n",
      "  \\label{item:inv:doctrine:simultaneous}\n",
      "  The intellect can entertain several simultaneous objects of knowledge. This\n",
      "  enables a self-knowledge that is temporally simultaneous with knowledge of an\n",
      "  external object.\n",
      "\n",
      "\\invitem{Science from observations of accidents is also science}\n",
      "  This counters the idea that science only proceeds from causes.\n",
      "  \\label{item:inv:science-from-observation-of-accidents}\n",
      "\n",
      "\\invitem{Soul does exists as something outside itself (in certain sense)}\n",
      "  Soul is not different from itself, but its \n",
      "  being does not depend on its operation.\n",
      "  \\label{item:inv:existence-outside-itself}\n",
      "\n",
      "\\invitem{Three types of knowledge from one species}\n",
      "  \\label{item:inv:doctrine:one-species-three-knowledges}\n",
      "  From an intelligible species knowledge can be obtained about\n",
      "  \\begin{inparaenum}\n",
      "  \\item the primary object of knowledge as a universal,\n",
      "  \\item the particular object giving rise to the knowledge, and\n",
      "  \\item the intellect realizing the knowing.\n",
      "  \\end{inparaenum}\n",
      "\n",
      "\\invitem{Superiority to sense-perception}\n",
      "  As the sense perception has an\n",
      "  ability of self-perception, the intellect must have an analogous ability, as\n",
      "  it is superior to sense perception and hence more able.\n",
      "  \\label{item:inv:doctrine:superior-to-sense-perception}\n",
      "\n",
      "\\invitem{Concomitant higher-order knowledge}\n",
      "  \\label{item:inv:doctrine:concomitant-higher-order}\n",
      "  When the intellect knows a primary object of knowledge, it also by necessity\n",
      "  knows that act of knowledge. This implies \\ref{item:inv:doctrine:simultaneous}\n",
      "  but is not the only possible instance of \\ref{item:inv:doctrine:simultaneous}.\n",
      "\n",
      "\\invitem{Soul intelligible as object of dubium}\n",
      "  When it is possible to wonder about something, \n",
      "  intelligibility is implied.\n",
      "  \\label{science:inv:science-object-of-dubium}\n",
      "\n",
      "\\invitem{Material objects can never become intellects}\n",
      "    \\label{inv:doctrine:material-objects-never-intellects}\n",
      "\n",
      "\\invitem{Certain science about simple subject}\n",
      "  The science about a simple\n",
      "  subject must be certain, and as the soul is simple, the science about it must\n",
      "  be certain, and (\\emph{a fortiori}) it must hence be possible to have a\n",
      "  science about it.\n",
      "  \\label{science:inv:doctrine:certain-science-simple-subject}\n",
      "\n",
      "\\invitem{Atemporal soul the actualization of temporal body}\n",
      "  The soul itself is atemporal, but it is \n",
      "  the actualization and perfection of a temporal body.\n",
      "  \\label{science:inv:atemporal-soul-temporal-actualization}\n",
      "\n",
      "\\invitem{Only material things cannot receive their own species}\n",
      "  \\label{item:inv:doctrine:material-no-reception-own-species}\n",
      "  Because material things are already actualized as their own species.\n",
      "\n",
      "\\invitem{Self-knowledge by innate species}\n",
      "  \\label{challenges:epist:SK-by-innate-species:positive}\n",
      "  \\label{challenges:epist:SK-by-innate-species:negative}\n",
      "  \\begin{enumerate}\n",
      "  \\item Some things are known by an innate species\n",
      "  \\item The intellect is one of the things that are known by an innate species.\n",
      "  \\item $\\therefore$ The intellect knows itself without the need of an external\n",
      "    species.\n",
      "  \\end{enumerate}\n",
      "\n",
      "\\invitem{Science by answering (four) scientific questions}\n",
      "  There can be a science about that which\n",
      "  answers the four basic analytical questions of a science, namely \\emph{si\n",
      "    est}, \\emph{quid est}, \\emph{quia est}, and \\emph{propter\n",
      "    quid}.\n",
      "  \\label{science:inv:doctrine:requirements-demonstration}\n",
      "\n",
      "\\invitem{Diversification only a problem with same mode of being}\n",
      "  The identity of categories between object and act only required in same mode of being. \n",
      "  \\label{item:inv:doctrine:diversification-different-modes-of-being}\n",
      "\n",
      "\\invitem{Soul is simple in essence but has different powers (partes potentiales)}\n",
      "  In itself the soul is simple, but it actualizes differt powers.\n",
      "  \\label{item:inv:simple-but-with-partes-potentiales}\n",
      "\n",
      "\\invitem{Act and potency with different respects}\n",
      "  In intellectual self-knowledge the act and potency are different in respect.\n",
      "  \\label{item:inv:doctrine:difference-in-respect}\n",
      "\n",
      "\\invitem{The agent intellect is known like any other object}\n",
      "  \\label{item:inv:doctrine:agent-intellect-intelligible}\n",
      "  \\begin{itemize}\n",
      "  \\item The possible intellect is able to know any intelligible object.\n",
      "  \\item The agent intellect is an intelligible object.\n",
      "  \\item $\\therefore$ The agent intellect can be known by the possible\n",
      "    intellect\n",
      "  \\end{itemize}\n",
      "\n",
      "\\invitem{Intellect is incorruptible}\n",
      "  This is based on the immaterial nature of the intellect, and \n",
      "  means that the entire soul is not corruptible.\n",
      "  \\label{item:inv:intellect-incorruptible}\n",
      "\n",
      "\\invitem{Essential self-knowledge results in no self-knowledge}\n",
      "  \\label{item:inv:doctrine:essential-SK-no-SK}\n",
      "  Knowledge requires the subject being stripped of the object of knowledge, but\n",
      "  nothing can be stripped of its own species.\n",
      "\n",
      "\\invitem{Transference of properties from agent to patient (e.g. light and the visible object)}\n",
      "  \\label{item:inv:doctrine:property-transference-cause-effect}\n",
      "  \\begin{enumerate}\n",
      "  \\item The efficient cause of a property possesses the property itself.\n",
      "  \\item The agent intellect causes potentially intelligible objects to be\n",
      "    actually intelligible.\n",
      "  \\item $\\therefore$ The agent intellect itself is intelligible.\n",
      "  \\end{enumerate}\n",
      "\n",
      "\\invitem{Soul not available to sense perception}\n",
      "  \\label{sec:science:inv:neg:not-perceptible:positive}\n",
      "  \\label{sec:science:inv:neg:not-perceptible:negative}\n",
      "  \\begin{enumerate}\n",
      "  \\item Science can only be about that which can be known, and scientific\n",
      "    knowledge can only be acquired through sense perception.\n",
      "  \\item The soul is not available to sense perception.\n",
      "  \\item $\\therefore$ There cannot be a science about the soul.\n",
      "  \\end{enumerate}\n",
      "\n",
      "\\invitem{Only physical movement requires difference between mover and moved}\n",
      "  \\label{item:inv:doctrine:physical-no-mover-moved}\n",
      "  The body makes identity of mover and moved impossible.\n",
      "\n",
      "\\invitem{Vague, incomplete self-knowledge possible}\n",
      "  \\label{item:inv:doctrine:vague-SK} Some\n",
      "  knowledge about the intellect or soul is attained, but it does not amount to a\n",
      "  full substantial knowledge. It may be qualified as simple, intuitive, and\n",
      "  immediate.\n",
      "\n",
      "\\invitem{Self-knowledge necessary for a science of the soul}\n",
      "  \\label{item:inv:doctrine:condition-for-science} Intellectual\n",
      "  self-knowledge is a necessary condition for a universal science about the\n",
      "  soul because some parts of the soul can only be known by introspection.\n",
      "\n",
      "\\invitem{Soul not intelligible to us}\n",
      "  \\label{sec:science:inv:neg:intelligible:negative}\n",
      "  \\label{sec:science:inv:neg:intelligible:positive}\n",
      "  \\begin{enumerate}\n",
      "  \\item The subject of a science must be intelligible.\n",
      "  \\item A soul is not intelligible.\n",
      "  \\item $\\therefore$ There cannot be a science about the soul.\n",
      "  \\end{enumerate}\n",
      "\n",
      "\\invitem{The intellect is intelligible like any other thing}\n",
      "  The intellect can be known\n",
      "  in the same way as any other intelligible thing. This argument implies a\n",
      "  reference to \\oldcitetitle[3.4, 430a2--3]{arist.DA}.\n",
      "  \\label{item:inv:doctrine:intelligible-as-any-other-thing}\n",
      "\n",
      "\\invitem{Agent intellect the most venerable object of knowledge}\n",
      "  \\label{item:inv:doctrine:agent-intellect-most-suitable}\n",
      "  If the possible intellect is disposed towards knowledge about lowly beings\n",
      "  such as material objects, it must so certainly also be disposed towards\n",
      "  knowledge about the elevated nature of the agent intellect.\n",
      "\n",
      "\\invitem{Science requires intelligible essence or definition}\n",
      "  \\label{item:inv:science-requires-intelligible-definition}\n",
      "\n",
      "\\invitem{Intellect not available to sense perception}\n",
      "  \\label{challenges:epist:sense-perception:positive}\n",
      "  \\label{challenges:epist:sense-perception:negative}\n",
      "  \\begin{enumerate}\n",
      "  \\item Anything that is intelligible is available to sense perception.\n",
      "  \\item The intellect is not available to sense perception\n",
      "  \\item $\\therefore$ The intellect cannot be intelligible.\n",
      "  \\end{enumerate}\n",
      "\n",
      "\\invitem{The intellect can know completely immaterial things}\n",
      "  \\label{item:inv:doctrine:immediate-knowing-immaterial-objects}\n",
      "  The knowledge is immediate, as there is no requirement of species reception of\n",
      "  immaterial objects.\n",
      "\n",
      "\\invitem{Four requirements of a science}\n",
      "  \\begin{inparaenum}\n",
      "  \\item A science is about a subject as a universal,\n",
      "  \\item which, as a universal, is incorruptible,\n",
      "  \\item has own parts and properties,\n",
      "  \\item and the science constitutes a knowledge that has an intellectual\n",
      "    immediacy in the reflection on the subject.\n",
      "  \\end{inparaenum}\n",
      "  \\label{science:inv:doctrine:four-requirements}\n",
      "\n",
      "\\invitem{Science of form and perfection}\n",
      "  There can be a science about the form and\n",
      "  perfection of a natural thing, which is the case for the soul.\n",
      "  \\label{science:inv:doctrine:form-perfection}\n",
      "\n",
      "\\end{inventory}\n",
      "\n",
      "\n"
     ]
    }
   ],
   "source": [
    "positive_inv = '\\\\begin{inventory}[label=P\\\\arabic*, font=\\\\bfseries]\\n\\n'\n",
    "\n",
    "for d in positive_sorted:\n",
    "    positive_inv += \"\\invitem{%s}%s\\n\" % (d['title'], d['note'])\n",
    "    \n",
    "positive_inv += '\\end{inventory}\\n\\n'\n",
    "print(positive_inv)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Negative"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {
    "scrolled": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\\begin{inventory}[label=N\\arabic*, font=\\bfseries]\n",
      "\n",
      "\\invitem{Soul not intelligible to us}\n",
      "  \\label{sec:science:inv:neg:intelligible:negative}\n",
      "  \\label{sec:science:inv:neg:intelligible:positive}\n",
      "  \\begin{enumerate}\n",
      "  \\item The subject of a science must be intelligible.\n",
      "  \\item A soul is not intelligible.\n",
      "  \\item $\\therefore$ There cannot be a science about the soul.\n",
      "  \\end{enumerate}\n",
      "\n",
      "\\invitem{Soul not available to sense perception}\n",
      "  \\label{sec:science:inv:neg:not-perceptible:positive}\n",
      "  \\label{sec:science:inv:neg:not-perceptible:negative}\n",
      "  \\begin{enumerate}\n",
      "  \\item Science can only be about that which can be known, and scientific\n",
      "    knowledge can only be acquired through sense perception.\n",
      "  \\item The soul is not available to sense perception.\n",
      "  \\item $\\therefore$ There cannot be a science about the soul.\n",
      "  \\end{enumerate}\n",
      "\n",
      "\\invitem{Identity of mover and moved impossible}\n",
      "  \\label{challenges:phys:mover-moved}\n",
      "  \\begin{enumerate}\n",
      "  \\item The same thing cannot be mover and moved at the same time and in the\n",
      "    same respect;\n",
      "  \\item if the intellect knew itself, it would be mover and moved in the same\n",
      "    time and in the same respect;\n",
      "  \\item $\\therefore$ the intellect cannot know itself.\n",
      "  \\end{enumerate}\n",
      "\n",
      "\\invitem{Intellect not available to sense perception}\n",
      "  \\label{challenges:epist:sense-perception:positive}\n",
      "  \\label{challenges:epist:sense-perception:negative}\n",
      "  \\begin{enumerate}\n",
      "  \\item Anything that is intelligible is available to sense perception.\n",
      "  \\item The intellect is not available to sense perception\n",
      "  \\item $\\therefore$ The intellect cannot be intelligible.\n",
      "  \\end{enumerate}\n",
      "\n",
      "\\invitem{Identity of knower and known impossible}\n",
      "  \\label{sec:science:inv:neg:knower-known}\n",
      "  \\begin{enumerate}\n",
      "  \\item In any knowledge there must be a real difference between the knower and\n",
      "    the known.\n",
      "  \\item In a science of the soul the same thing would be knower and known.\n",
      "  \\item $\\therefore$ There cannot be a science about the soul.\n",
      "  \\end{enumerate}\n",
      "\n",
      "\\invitem{Knowledge is continuous and temporal, but soul is simple}\n",
      "  \\label{sec:science:inv:neg:continuous-temporal}\n",
      "  \\begin{enumerate}\n",
      "  \\item All human knowledge is a continuous and temporal process.\n",
      "  \\item The soul is neither continuous nor temporal.\n",
      "  \\item $\\therefore$ The soul cannot be intelligible.\n",
      "  \\end{enumerate}\n",
      "\n",
      "\\invitem{Science about subject, parts or properties, principles}\n",
      "  \\label{science:inv:doctrine:subject-properties-principles:positive}\n",
      "  \\label{science:inv:doctrine:subject-properties-principles:negative}\n",
      "  A science requires\n",
      "  \\begin{inparaenum}\n",
      "  \\item a subject,\n",
      "  \\item properties that are ascribed to the subject, and\n",
      "  \\item the principle according to which the properties are ascribed to it.\n",
      "  \\end{inparaenum}\n",
      "  Positive use: The investigation of the soul fulfills all these three requirements. The\n",
      "  definition of the soul can be used as the principle by which the properties\n",
      "  are ascribed to the subject.\n",
      "\n",
      "  Negative use: The soul as form is not a subject, because it is not a hylomorphic compound.\n",
      "\n",
      "\\invitem{Similar to separate intelligences}\n",
      "  \\label{challenges:ont:intellect-intelligences}\n",
      "  \\begin{enumerate}\n",
      "  \\item The separate intelligences know themselves by their own substance\n",
      "  \\item The intellect is similar to the separate intelligences\n",
      "  \\item $\\therefore$ The intellect knows itself by its own substance.\n",
      "  \\end{enumerate}\n",
      "\n",
      "\\invitem{Things most manifest in nature are opaque, so no science of the soul}\n",
      "  \\label{sec:science:inv:neg:most-manifest-in-nature}\n",
      "  \\begin{enumerate}\n",
      "  \\item The things most manifest by nature cannot be known by the intellect.\n",
      "  \\item The soul is among the things most manifest by nature.\n",
      "  \\item $\\therefore$ The soul cannot be known by the intellect.\n",
      "  \\end{enumerate}\n",
      "\n",
      "\\invitem{Knowing the act of the intellect risks infinite regress}\n",
      "  \\label{challenges:phys:infinite-regress}\n",
      "  \\begin{enumerate}\n",
      "  \\item If the intellect knows its own activity, that knowledge constitutes a\n",
      "    second order activity.\n",
      "  \\item If that new activity is intelligible, then the knowledge of that\n",
      "    constitutes a third order activity.\n",
      "  \\item From this an infinite regress arises.\n",
      "  \\item Infinite regresses are impossible.\n",
      "  \\item $\\therefore{}$ The intellect cannot know itself by a separate activity.\n",
      "  \\end{enumerate}\n",
      "\n",
      "\\invitem{Soul is a particular, so there can be no science about it}\n",
      "  \\label{sec:science:inv:neg:soul-particular}\n",
      "  \\begin{enumerate}\n",
      "  \\item A science must be about universals.\n",
      "  \\item A soul as the form of a body is a particular.\n",
      "  \\item $\\therefore$ There cannot be a science about the soul.\n",
      "  \\end{enumerate}\n",
      "\n",
      "\\invitem{Analogy with sense and sensation}\n",
      "  \\label{challenges:epist:sense-analogy}\n",
      "  \\begin{enumerate}\n",
      "  \\item As the senses stand to sensation, so does the intellect stand to\n",
      "    knowing.\n",
      "  \\item The senses cannot perceive their own sensation\n",
      "  \\item $\\therefore$ The intellect cannot know its own knowledge.\n",
      "  \\end{enumerate}\n",
      "\n",
      "\\invitem{No abstraction of the intellect}\n",
      "  \\label{challenges:epist:no-abstraction}\n",
      "  \\begin{enumerate}\n",
      "  \\item Human knowledge is based on phantasms abstracted from sense perception.\n",
      "  \\item The intellect cannot be abstracted from matter\n",
      "  \\item $\\therefore$ The intellect cannot be know through an abstracted\n",
      "    species.\n",
      "  \\end{enumerate}\n",
      "\n",
      "\\invitem{No science about corruptible things}\n",
      "  \\label{sec:science:inv:neg:soul-corruptible}\n",
      "  \\begin{enumerate}\n",
      "  \\item There is no science about corruptible things.\n",
      "  \\item The soul is corruptible as the form of a corruptible body.\n",
      "  \\item $\\therefore$ There cannot be a science about the soul.\n",
      "  \\end{enumerate}\n",
      "\n",
      "\\invitem{Nothing can be stripped of itself}\n",
      "  \\label{sec:science:inv:neg:denudation}\n",
      "  \\begin{enumerate}\n",
      "  \\item The intellect ought to be stripped of its object of knowledge before\n",
      "    knowing it.\n",
      "  \\item Nothing can be stripped of itself.\n",
      "  \\item $\\therefore$ There cannot be a science about the soul.\n",
      "  \\end{enumerate}\n",
      "\n",
      "\\invitem{Intellect not its own proper object of knowledge}\n",
      "  \\label{challenges:epist:proper-object:positive}\n",
      "  \\label{challenges:epist:proper-object:negative}\n",
      "  \\begin{enumerate}\n",
      "  \\item The intellect knows its objects of knowledge.\n",
      "  \\item The intellect is not its own object of knowledge.\n",
      "  \\item $\\therefore$ The intellect is not intelligible to itself.\n",
      "  \\end{enumerate}\n",
      "\n",
      "\\invitem{Self-knowledge by innate species}\n",
      "  \\label{challenges:epist:SK-by-innate-species:positive}\n",
      "  \\label{challenges:epist:SK-by-innate-species:negative}\n",
      "  \\begin{enumerate}\n",
      "  \\item Some things are known by an innate species\n",
      "  \\item The intellect is one of the things that are known by an innate species.\n",
      "  \\item $\\therefore$ The intellect knows itself without the need of an external\n",
      "    species.\n",
      "  \\end{enumerate}\n",
      "\n",
      "\\invitem{All intelligibles become intellects if intellect is intelligible}\n",
      "  \\label{challenges:ont:intelligibles-intellects}\n",
      "  \\begin{enumerate}\n",
      "  \\item All intelligibles are intelligible by the same form.\n",
      "    \\label{challenges:ont:intelligibles-intellects:1}\n",
      "  \\item The intellect is intelligible and has reason by one form.\n",
      "    \\label{challenges:ont:intelligibles-intellects:2}\n",
      "  \\item If \\ref{challenges:ont:intelligibles-intellects:2} then all\n",
      "    intelligibles are intelligible by the same form as the intellect.\n",
      "    \\label{challenges:ont:intelligibles-intellects:3}\n",
      "  \\item If \\ref{challenges:ont:intelligibles-intellects:3} then all\n",
      "    intelligibles have reason.\n",
      "    \\label{challenges:ont:intelligibles-intellects:4}\n",
      "  \\item \\ref{challenges:ont:intelligibles-intellects:4} is false.\n",
      "    \\label{challenges:ont:intelligibles-intellects:5}\n",
      "  \\item $\\therefore$ The intellect cannot be intelligible.\n",
      "    \\label{challenges:ont:intelligibles-intellects:6}\n",
      "  \\end{enumerate}\n",
      "  This could be seen as an interpretation of the argument Aristotle presents\n",
      "  against the idea that the intellect knows itself by\n",
      "  itself.\\footnote{\\oldcite[3.4, 429b27--28]{arist.DA}: ``    \n",
      "    ,      ,       \\dots{}''}\n",
      "\n",
      "\\invitem{No universal about the soul, as it requires sense perception}\n",
      "  \\label{sec:science:inv:neg:no-universal-of-soul}\n",
      "  \\begin{enumerate}\n",
      "  \\item A science is about a universal.\n",
      "  \\item Universals are abstracted from sense perception, but the soul is not\n",
      "    available to sense perception.\n",
      "  \\item $\\therefore$ There can be no universal (and hence no science) about the\n",
      "    soul.\n",
      "  \\end{enumerate}\n",
      "\n",
      "\\invitem{No simultaneous act and potency}\n",
      "  \\label{sec:science:inv:neg:act-potency}\n",
      "  \\begin{enumerate}\n",
      "  \\item The same thing cannot be in act and potency at the same time and in the\n",
      "    same respect.\n",
      "  \\item The object of knowledge is in act with respect to the knowing subject,\n",
      "    and the knowing subject is in potentiality with respect to the object of\n",
      "    knowledge.\n",
      "  \\item The intellect cannot know itself.\n",
      "  \\end{enumerate}\n",
      "\n",
      "\\invitem{The possible intellect is not actualized}\n",
      "  \\label{challenges:epist:intellect-not-actualized}\n",
      "  \\begin{enumerate}\n",
      "  \\item All that is intelligible is actual.\n",
      "  \\item The intellect is not actual.\n",
      "  \\item $\\therefore$ The intellect is not intelligible.\n",
      "  \\end{enumerate}\n",
      "\n",
      "\\invitem{Material intelligibles cannot know themselves}\n",
      "  \\label{item:inv:challenges:intelligibles-no-SK}\n",
      "  \\begin{enumerate}\n",
      "  \\item The intellect is known in the same way as other objects of knowledge.\n",
      "  \\item Other objects of knowledge are not self-intelligible.\n",
      "  \\item $\\therefore$ The intellect is not self-intelligible.\n",
      "  \\end{enumerate}\n",
      "\n",
      "\\invitem{No species proportional to the intellect}\n",
      "  \\label{challenges:epist:proportional-species}\n",
      "  \\begin{enumerate}\n",
      "  \\item When something is known through a species, that must be proportional to\n",
      "    the thing known.\n",
      "  \\item Any external species cannot be proportional to the intellect.\n",
      "  \\item $\\therefore$ The intellect cannot be known by an external species.\n",
      "  \\end{enumerate}\n",
      "\n",
      "\\invitem{No experience of higher-order knowledge}\n",
      "  \\label{challenges:no-experience}\n",
      "  \\begin{enumerate}\n",
      "  \\item We sense our state of sensation, so we should also know our states of\n",
      "    knowing.\n",
      "  \\item We do not experience any higher order knowledge.\n",
      "  \\item $\\therefore$ Higher order knowledge does not take place.\n",
      "  \\end{enumerate}\n",
      "\n",
      "\\invitem{Essential self-intelligibility by self-identity}\n",
      "  \\label{inv:challenges:essential-self-identity}\n",
      "  \\begin{enumerate}\n",
      "  \\item The intellect is identical with that which it knows when it knows.\n",
      "  \\item That which is known is intelligible.\n",
      "  \\item The intellect knows by its own essence.\n",
      "  \\item $\\therefore$ The intellect is intelligible by its own essence.\n",
      "  \\end{enumerate}\n",
      "\n",
      "\\invitem{Agent intellect has no positive content}\n",
      "  \\label{item:inv:challenges:agent-intellect-no-knowledge}\n",
      "  \\begin{enumerate}\n",
      "  \\item The power of the agent intellect is abstraction of universals.\n",
      "  \\item Abstraction of universals cannot be intelligible, because then the agent\n",
      "    intellect would know the universals itself.\n",
      "  \\item $\\therefore$ The power of the agent intellect cannot be known.\n",
      "  \\end{enumerate}\n",
      "\n",
      "\\invitem{Accidents cannot affect their own subject}\n",
      "  \\label{challenges:ont:accidents-affecting-subjects}\n",
      "  \\begin{enumerate}\n",
      "  \\item Knowledge takes place by an affection of the intellect.\n",
      "  \\item Accidents cannot affect the subjects in which they are properties.\n",
      "  \\item An act of intellection is an accident of the intellect.\n",
      "  \\item $\\therefore$ The act of intellection cannot affect the intellect, and\n",
      "    hence it cannot be known by the intellect.\n",
      "  \\end{enumerate}\n",
      "\n",
      "\\invitem{Nothing can move itself (knowledge is being-moved)}\n",
      "  \\label{item:inv:negative:arg:no-self-mover}\n",
      "  \\begin{enumerate}\n",
      "  \\item What cannot move the intellect cannot be known.\n",
      "  \\item Nothing can move itself.\n",
      "  \\item $\\therefore$ The possible intellect cannot know the possible\n",
      "    intellect.\n",
      "  \\end{enumerate}\n",
      "\n",
      "\\invitem{Diversification of knowledge according to object}\n",
      "  \\label{challenges:diversification-according-to-object}\n",
      "  \\begin{enumerate}\n",
      "  \\item The act of knowing is determined by the nature of the object of\n",
      "    knowledge.\\footnote{Cf. \\oldcite[ad III.4 429b10--14, com. III.9, p.\n",
      "      422.36--50]{averroes.Com-DA}.}\n",
      "  \\item The primary object of knowledge and the act of knowing have\n",
      "    two different natures.\n",
      "  \\item $\\therefore$ The intellect cannot know both types of objects.\n",
      "  \\end{enumerate}\n",
      "\n",
      "\\invitem{No essential self-knowledge, so not self-knowledge by own species}\n",
      "  \\label{challenges:ont:immaterial-SK-by-species}\n",
      "  \\begin{enumerate}\n",
      "  \\item In immaterial substances the same thing is knower and known.\n",
      "  \\item If the intellect knows itself by its own species, it will know\n",
      "    itself by itself.\n",
      "  \\item $\\therefore$ The intellect cannot know itself by itself, hence it cannot\n",
      "    know itself by its own species.\n",
      "  \\end{enumerate}\n",
      "\n",
      "\\invitem{Science proceeds from causes, so no science about the soul}\n",
      "  \\label{sec:science:inv:neg:science-from-causes}\n",
      "  \\begin{enumerate}\n",
      "  \\item All science proceeds from causes.\n",
      "  \\item The soul is not known through its causes.\n",
      "  \\item $\\therefore$ There cannot be a science of the soul.\n",
      "  \\end{enumerate}\n",
      "\n",
      "\\invitem{Essential self-knowledge by self-presence}\n",
      "  \\label{challenges:ont:SK-by-presence}\n",
      "  \\begin{enumerate}\n",
      "  \\item Knowledge requires presence of the known object to the knowing subject\n",
      "  \\item The intellect is present to itself by itself.\n",
      "  \\item $\\therefore$ The intellect knows itself by itself.\n",
      "  \\end{enumerate}\n",
      "\n",
      "\\invitem{Intelligibility requires actuality}\n",
      "  \\label{item:inv:doctrine:intelligibility-requires-actuality:positive}\n",
      "  \\label{item:inv:doctrine:intelligibility-requires-actuality:negative}\n",
      "  No potential property or substance can be actually intelligible. This finds\n",
      "  support in \\oldcite[9.10, 1051b30--32]{arist.Metaph}.\n",
      "\n",
      "\\invitem{Intellectual self-knowledge is impossible}\n",
      "  \\label{sec:science:inv:neg:self-knowledge}\n",
      "  \\begin{enumerate}\n",
      "  \\item If there were a science of the soul the intellect would be able to know\n",
      "    itself.\n",
      "  \\item The intellect cannot know itself.\n",
      "  \\item $\\therefore$ There cannot be a science of the soul.\n",
      "  \\end{enumerate}\n",
      "\n",
      "\\invitem{Nothing simpler than the intellect, hence no species abstraction}\n",
      "  \\label{challenges:epist:simpler-species}\n",
      "  \\begin{enumerate}\n",
      "  \\item A species is simpler than the thing from which it is abstracted.\n",
      "  \\item The intellect does not have a species that is simpler than itself.\n",
      "  \\item $\\therefore$ The intellect cannot be known by a species.\n",
      "  \\end{enumerate}\n",
      "\n",
      "\\invitem{No science about the non-existent}\n",
      "  \\label{sec:science:inv:neg:soul-not-exist}\n",
      "  \\begin{enumerate}\n",
      "  \\item There cannot be a science about that which does not exist.\n",
      "  \\item The soul does not exist.\n",
      "  \\item $\\therefore$ There cannot be a science about the soul.\n",
      "  \\end{enumerate}\n",
      "\n",
      "\\invitem{Knowing agent intellect means knowing all phantasms}\n",
      "  \\label{challenges:epist:all-phantasms}\n",
      "  \\begin{enumerate}\n",
      "  \\item If the possible intellect could know the agent intellect, this would be\n",
      "    through its abstraction of phantasms.\n",
      "  \\item The agent intellect abstracts all phantasms.\n",
      "  \\item $\\therefore$ The possible intellect cannot contain all phantasms at the\n",
      "    same time; hence, the possible intellect cannot know the agent intellect.\n",
      "  \\end{enumerate}\n",
      "\n",
      "\\invitem{Nothing can receive its own species}\n",
      "  \\label{challenges:phys:self-reception}\n",
      "  \\begin{enumerate}\n",
      "  \\item The possible intellect only has knowledge by reception of the species of\n",
      "    the object.\n",
      "  \\item Nothing can receive itself.\n",
      "  \\item $\\therefore$ The intellect cannot have knowledge of itself.\n",
      "  \\end{enumerate}\n",
      "\n",
      "\\invitem{Power of the agent intellect not intelligible}\n",
      "\\begin{enumerate}\n",
      "\\item If the intellect is known, then its power is also known.\n",
      "\\item The power of the intellect cannot be known.\n",
      "\\item $\\therefore$ The intellect cannot be known.\n",
      "\\end{enumerate}\n",
      "\\label{item:inv:power-not-intelligible}\n",
      "\n",
      "\\invitem{The intellect has essential self-knowledge}\n",
      "  \\label{item:inv:doctrine:essential-self-knowledge:positive}\n",
      "  \\label{item:inv:doctrine:essential-self-knowledge:negative}\n",
      "  The intellect has essential self-knowledge and is hence not known through an\n",
      "  external species.\n",
      "\n",
      "\\invitem{Multiple simultaneous objects of knowledge impossible}\n",
      "  \\label{item:inv:no-simultaneous-objects}\n",
      "  The intellect cannot be actualized by more than one species at any time.\n",
      "\n",
      "\\end{inventory}\n",
      "\n",
      "\n"
     ]
    }
   ],
   "source": [
    "negative_inv = '\\\\begin{inventory}[label=N\\\\arabic*, font=\\\\bfseries]\\n\\n'\n",
    "\n",
    "for d in negative_sorted:\n",
    "    negative_inv += \"\\invitem{%s}%s\\n\" % (d['title'], d['note'])\n",
    "    \n",
    "negative_inv += '\\end{inventory}\\n\\n'\n",
    "print(negative_inv)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
